<template>
  <div>
    <h3 class="title">天府绿道软件许可及隐私协议</h3>
    <br />
    <div>
      成都天府绿道建设投资公司（下称“天府绿道公司”）在此特别提醒您（下称“用户”）认真阅读、充分理解本《
      天府绿道软件许可及服务协议》（下称《协议》）---
      您应认真阅读、充分理解本《协议》中各条款，
      包括免除或者限制天府绿道公司责任的免责条款及对用户的权利限制条款。请您审慎阅读并选择接受或不接受本《协议》（未成年人应在法定监护人陪同下阅读）。
      除非您接受本《协议》所有条款，否则您无权注册、登录或使用本协议所涉相关服务。您的注册、登录、使用等行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。
      <br />
      您对本协议的接受即受本《协议》全部条款的约束，包括接受天府绿道公司对任一服务条款随时所做的任何修改。本《协议》可由天府绿道公司随时更新，
      更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在相关服务页面查阅最新版协议条款。在天府绿道公司修改《协议》条款后，
      如果您不接受修改后的条款，请立即停止使用天府绿道公司提供的服务，用户继续使用天府绿道公司提供的服务将被视为已接受了修改后的协议。
    </div>
    <h4>一、协议的范围</h4>
    <div>
      1.1 协议适用主体范围
      本协议是用户与天府绿道公司之间关于用户下载、安装、使用、复制天府绿道软件（下称“本软件”），以及使用天府绿道公司相关服务（下称“本服务”）所订立的协议。
      “用户”是指注册、登录、使用、浏览本服务的个人或组织。<br />
      1.2
      本协议内容同时包括天府绿道公司可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。
    </div>
    <h4>二、关于本服务</h4>
    <div>
      2.1 本服务的内容
      本服务内容是指天府绿道公司向用户提供的跨平台旅游服务（下称“天府绿道”），支持旅游资讯服务阅读、旅游目的地导览等服务的基础上，
      同时为用户提供包括但不限于关系链拓展、人工智能等功能或内容的软件许可及服务（下称“本服务”）。<br />
      2.2 本服务的形式<br />
      本服务中天府绿道客户端软件提供包括但不限于iOS、Android、微信小程序、微信公众号等多个应用版本（以下称为“本软件”），用户必须选择与所安装终端设备相匹配的软件版本。<br />
      2.3 本服务许可的范围<br />
      2.3.1
      天府绿道公司给予您一项个人的、不可转让及非排他性的许可，以使用本软件。您可以为非商业目的在单一台终端设备上安装、使用、显示、运行本软件。<br />
      2.3.2
      本条及本协议其他条款未明示授权的其他一切权利仍由天府绿道公司保留，您在行使这些权利时须另外取得天府绿道公司的书面许可。
      天府绿道公司如果未行使前述任何权利，并不构成对该权利的放弃。
    </div>
    <h4>三、软件的获取</h4>
    <div>
      3.1
      您可以直接从天府绿道公司或天府绿道的网站上获取本软件，也可以从得到天府绿道公司授权的第三方获取。<br />
      3.2
      如果您从未经天府绿道公司授权的第三方获取本软件或与本软件名称相同的安装程序，天府绿道公司无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。
    </div>
    <h4>四、软件的安装与卸载</h4>
    <div>
      4.1
      天府绿道公司可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。<br />
      4.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。<br />
      4.3
      为提供更加优质、安全的服务，在本软件安装时天府绿道公司可能推荐您安装其他软件，您可以选择安装或不安装。<br />
      4.4
      如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助天府绿道公司改进产品服务，请告知卸载的原因。<br />
    </div>
    <h4>五、软件的更新</h4>
    <div>
      5.1
      为了改善用户体验、完善服务内容，天府绿道公司将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。<br />
      5.2
      为了保证本软件及服务的安全性和功能的一致性，天府绿道公司有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。<br />
      5.3
      本软件新版本发布后，旧版本的软件可能无法使用。天府绿道公司不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。<br />
    </div>
    <h4>六、用户个人信息保护</h4>
    <div>
      6.1
      保护用户个人信息是天府绿道公司的一项基本原则，天府绿道公司将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可天府绿道公司不会向第三方公开、透露用户个人信息。
      天府绿道公司对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。<br />
      6.2
      您在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供帐号注册服务或进行用户身份识别，需要您填写手机号码；导览和运动助手功能需要您同意使用您所在的地理位置信息；
      实名认证和写游记功能需要获取手机图库权限。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。<br />
      6.3
      一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。<br />
      6.4
      天府绿道公司将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。<br />
      6.5
      未经您的同意，天府绿道公司不会向天府绿道公司以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。<br />
      6.6
      天府绿道公司非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用天府绿道公司的服务前，应事先取得您家长或法定监护人的书面同意。<br />
    </div>
    <h4>七、主权利义务条款</h4>
    <div>
      7.1 帐号使用规范 7.1.1
      您在使用本服务前需要注册一个天府绿道帐号，天府绿道帐号可通过手机号码或微信号进行注册,并可在注册成功后绑定微信、手机号和QQ号码。天府绿道公司有权根据用户需求或产品需要对帐号注册和绑定的方式进行变更。<br />
      7.1.2
      天府绿道帐号的所有权归天府绿道公司所有，用户完成申请注册手续后，仅获得天府绿道帐号的使用权，且该使用权仅属于初始申请注册人。
      同时，初始申请注册人不得赠与、借用、租用、转让或售卖天府绿道帐号或者以其他方式许可非初始申请注册人使用天府绿道帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用天府绿道帐号。<br />
      7.1.3
      用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，您应立即通知天府绿道公司。<br />
      7.1.4
      用户在使用手机号码绑定或注册天府绿道帐号时，系统将为您自动匹配账号，设置账号后将无法修改。<br />
      7.1.5
      用户注册天府绿道帐号后如果长期不登录该帐号，天府绿道公司有权回收该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。<br />
      7.2 用户注意事项<br />
      7.2.1
      您理解并同意：为了向您提供有效的服务，本软件会利用您终端设备的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。<br />
      7.2.2
      您在使用本软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您接受相关单独协议。<br />
      7.2.3
      您理解并同意天府绿道公司将会尽其商业上的合理努力保障您在本软件及服务中的数据存储安全，但是，天府绿道公司并不能就此提供完全保证，包括但不限于以下情形：<br />
      7.2.3.1
      天府绿道公司不对您在本软件及服务中相关数据的删除或储存失败负责；<br />
      7.2.3.2
      天府绿道公司有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本软件及服务中的相关数据；<br />
      7.2.3.3
      如果您停止使用本软件及服务或服务被终止或取消，天府绿道公司可以从服务器上永久地删除您的数据。服务停止、终止或取消后，天府绿道公司没有义务向您返还任何数据。<br />
      7.2.4
      用户在使用本软件及服务时，须自行承担如下来自天府绿道公司不可掌控的风险内容，包括但不限于：<br />
      7.2.4.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；<br />
      7.2.4.2
      用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；<br />
      7.2.4.3
      用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；<br />
      7.2.4.4
      用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；<br />
      7.2.4.5
      由于无线网络信号不稳定、无线网络带宽小等原因，所引起的天府绿道登录失败、资料同步不完整、页面打开速度慢等风险。<br />
      7.3 第三方产品和服务<br />
      7.3.1
      您在使用本软件第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。天府绿道公司和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。<br />
      7.3.2
      因用户使用本软件或要求天府绿道公司提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供
      （包括但不限于第三方通过天府绿道公众帐号提供的服务，或通过开放平台接入的内容等），天府绿道公司不保证通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，
      由此若引发的任何争议及损害，与天府绿道公司无关，天府绿道公司不承担任何责任。<br />
      7.3.3
      您理解并同意，天府绿道公司有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方作推广等，天府绿道公司承诺在推广过程中严格按照本协议约定保护您的个人信息，
      同时您亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。
    </div>
    <h4>八、用户行为规范</h4>
    <div>
      8.1 信息内容规范<br />
      8.1.1
      本条所述信息内容是指用户使用本软件及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于天府绿道帐号头像、名字、用户说明等注册信息，或文字、语音、图片等发送、回复、相关链接页面，以及其他使用天府绿道帐号或本软件及服务所产生的内容。<br />
      8.1.2
      您理解并同意，天府绿道一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用天府绿道帐号或本软件及服务制作、复制、发布、传播如下干扰天府绿道正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：<br />
      8.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：<br />
      （1）违反宪法确定的基本原则的；<br />
      （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br />
      （3）损害国家荣誉和利益的；<br />
      （4）煽动民族仇恨、民族歧视，破坏民族团结的；<br />
      （5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
      （6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
      （7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br />
      （8）侮辱或者诽谤他人，侵害他人合法权益的；<br />
      （9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br />
      （10）以非法民间组织名义活动的；<br />
      （11）不符合遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；<br />
      （12）含有法律、行政法规禁止的其他内容的。<br />
      8.1.2.2
      发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；<br />
      8.1.2.3 涉及他人隐私、个人信息或资料的；<br />
      8.1.2.4
      发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；<br />
      8.1.2.5
      其他违反法律法规、政策及公序良俗、社会公德或干扰天府绿道正常运营和侵犯其他用户或第三方合法权益内容的信息。<br />
      8.2 软件使用规范<br />
      8.2.1
      除非法律允许或天府绿道公司书面许可，你使用本软件过程中不得从事下列行为：<br />
      8.2.1.1 删除本软件及其副本上关于著作权的信息；<br />
      8.2.1.2
      对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；<br />
      8.2.1.3
      对天府绿道公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；<br />
      8.2.1.4
      对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、
      挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非天府绿道公司经授权的第三方工具/服务接入本软件和相关系统；<br />
      8.2.1.5
      通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br />
      8.2.1.6
      通过非天府绿道公司开发、授权的第三方软件、插件、外挂、系统，登录或使用天府绿道公司软件及服务，或制作、发布、传播上述工具；<br />
      8.2.1.7
      自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；<br />
      8.2.1.8 其他未经天府绿道公司明示授权的行为。<br />
      8.2.2
      您理解并同意，基于用户体验、天府绿道或相关服务平台运营安全、平台规则要求及健康发展等综合因素，天府绿道公司有权选择提供服务的对象，有权决定功能设置，有权决定功能开放、
      数据接口和相关数据披露的对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：<br />
      8.2.2.1 违反法律法规或本协议规定的；<br />
      8.2.2.2 影响服务体验的；<br />
      8.2.2.3 存在安全隐患的；<br />
      8.2.2.4
      与天府绿道或其服务平台已有主要功能或功能组件相似、相同，或可实现上述功能或功能组件的主要效用的；<br />
      8.2.2.5
      界面、风格、功能、描述或使用者体验与天府绿道或其服务平台类似，可能造成天府绿道用户认为其所使用的功能或服务来源于天府绿道公司或经天府绿道公司授权的；<br />
      8.2.2.6
      违背天府绿道或其服务平台运营原则，或不符合天府绿道公司其他管理要求的。<br />
      8.3 对自己行为负责<br />
      你充分了解并同意，你必须为自己注册帐号下的一切行为负责，包括你所发表的任何内容以及由此产生的任何后果。你应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，
      包括因对内容的正确性、完整性或实用性的依赖而产生的风险。天府绿道公司无法且不会对因前述风险而导致的任何损失或损害承担责任。<br />
      8.4 违约处理<br />
      8.4.1
      如果天府绿道公司发现或收到他人举报或投诉用户违反本协议约定的，天府绿道公司有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、
      限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。<br />
      8.4.2
      您理解并同意，天府绿道公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。<br />
      8.4.3
      您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；天府绿道公司因此遭受损失的，您也应当一并赔偿。<br />
    </div>
    <h4>九、知识产权声明</h4>
    <div>
      9.1
      天府绿道公司是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（
      包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，天府绿道公司享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。<br />
      9.2
      未经天府绿道公司或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。<br />
      9.3
      您接受本协议条款，即表明该您将在本软件发表的任何形式的信息的著作权，包括并不限于：复制权、发行权、出租权、展览权、表演权、
      放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给天府绿道公司所有，同时表明该您许可天府绿道公司有权利就任何主体侵权而单独提起诉讼，并获得全部赔偿。<br />
      9.4
      协议已经构成《著作权法》第二十五条所规定的书面协议，其效力及于您在天府绿道公司发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。
      您同意并明确了解上述条款，不将已发表于本软件的信息，以任何形式发布或授权其它网站及媒体（天府绿道公司关联公司网站除外）使用。同时，天府绿道公司保留删除站内各类不符合规定的信息而不通知您的权利。<br />
      9.5
      本软件所有信息受《中华人民共和国著作权法》及相关法律法规和中国加入的所有知识产权方面的国际条约的保护。我们制定了旨在保护知识产权权利人合法权益的相关措施和步骤，
      当著作权人和/或依法可以行使信息网络传播权的权利人（以下简称“权利人”）发现可能存有侵犯其信息网络传播权的情况，权利人应事先向本软件发出书面权利通知，并提供有效权属证明，
      天府绿道公司将根据相关法律规定采取措施删除相关内容。同时您登陆本软件提交相关评论、文章或其他信息通过天府绿道公司编辑发布的，天府绿道公司享有著作权，
      天府绿道公司有权在本网站及关联公司网站使用您在本软件上发表的信息（包括但不限于图片、游记等），但您在本软件上发表的信息若其它浏览者要转载，需经过天府绿道公司和您的许可，
      否则视为侵权，其他任何第三人未经天府绿道公司允许，不得以任何形式复制、转载或采用。因您或其他第三人违反本法律声明而引发的任何一切索赔、损害等等，天府绿道公司概不负责。<br />
      9.6
      天府绿道公司不保证为向您提供便利而设置的外部链接的准确性和完整性，若由此而引起的版权问题或其他问题，请致电或电邮天府绿道公司。经核实后会立即予以删除或更改。
    </div>
    <h4>十、终端安全责任</h4>
    <div>
      10.1
      您理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，
      包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，
      继而影响本软件的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。<br />
      10.2
      您不得制作、发布、使用、传播用于窃取天府绿道帐号及他人个人信息、财产的恶意程序。<br />
      10.3
      维护软件安全与正常使用是天府绿道公司和您的共同责任，天府绿道公司将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意天府绿道公司并不能就此提供完全保证。<br />
      10.4
      在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意天府绿道公司有关防范诈骗犯罪的提示。<br />
    </div>
    <h4>十一、第三方软件或技术</h4>
    <div>
      11.1
      本软件可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。<br />
      11.2
      本软件如果使用了第三方的软件或技术，天府绿道公司将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包、或通过开源软件页面等形式进行展示，
      它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，
      您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求天府绿道公司给予协助，您应当自行承担法律责任。<br />
      11.3
      如因本软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，天府绿道公司不承担任何责任。天府绿道公司不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。
    </div>
    <h4>十二、其他</h4>
    <div>
      12.1
      天府绿道公司郑重提醒用户注意本《协议》中免除天府绿道公司责任和加重用户义务的条款，请用户仔细阅读，自主考虑风险。<br />
      12.2 本《协议》所定的任何条款的部分或全部无效者，不影响其它条款的效力。<br />
      12.3
      本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。<br />
      12.4
      本《协议》签订地为人民共和国四川省武侯区高新区。本《协议》的解释、效力及纠纷的解决，适用于中华人民共和国法律大陆地区法律。若用户和天府绿道公司之间发生任何纠纷或争议，
      首先应友好协商解决；协商不成的，你同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。<br />
      12.5
      本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（正文完）<br />
      12.6
      若您对天府绿道公司及本服务有任何意见，欢迎垂询天府绿道公司客服中心。天府绿道公司客户服务网站：<a
        href="http://www.tianfugreenroad.com/"
        >www.tianfugreenroad.com</a
      >
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style>
.title {
  text-align: center;
  font-size: 18px;
  font-family: PingFangSC-Semibold, PingFang SC;
  font-weight: 600;
}
h4 {
  font-family: PingFangSC-Semibold, PingFang SC;
  font-weight: 400;
}
div {
  font-family: PingFangSC-Semibold, PingFang SC;
  font-weight: 200;
}
</style>
